blaezec/stm32f4/stm32f4/serialUSB/main.c
/**
******************************************************************************
* @file    main.c 
* @author  MCD Application Team
* @version V1.0.0
* @date    19-September-2011
* @brief   Main program body
******************************************************************************
* @attention
*
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
* TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
* DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
* FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
* CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*
* <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
******************************************************************************
*/ 
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "usbd_cdc_core.h"
#include "usbd_usr.h"
#include "usbd_desc.h"
#include "usbd_cdc_vcp.h"

//Library config for this project!!!!!!!!!!!
#include "stm32f4xx_conf.h"

// does this work?
// #include <stdio.h>

/** @addtogroup STM32F4-Discovery_Demo
* @{
*/

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

#define TESTRESULT_ADDRESS         0x080FFFFC
#define ALLTEST_PASS               0x00000000
#define ALLTEST_FAIL               0x55555555

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
#ifdef USB_OTG_HS_INTERNAL_DMA_ENABLED
  #if defined ( __ICCARM__ ) /*!< IAR Compiler */
    #pragma data_alignment = 4   
  #endif
#endif /* USB_OTG_HS_INTERNAL_DMA_ENABLED */
    __ALIGN_BEGIN USB_OTG_CORE_HANDLE  USB_OTG_dev __ALIGN_END;

    __IO uint32_t TimingDelay;


/* Private function prototypes -----------------------------------------------*/


/* Private functions ---------------------------------------------------------*/

/**
* @brief  Main program.
* @param  None
* @retval None
*/
int main(void)
{
    uint8_t currentLED;
    currentLED=0;
  /* Initialize LEDs and User_Button on STM32F4-Discovery --------------------*/

    __IO uint32_t i = 0;  
    uint8_t buf[255];
    uint8_t len;
    USBD_Init(&USB_OTG_dev,     
        USB_OTG_FS_CORE_ID, 
        &USR_desc, 
        &USBD_CDC_cb, 
        &USR_cb);


    STM_EVAL_LEDInit(LED4);
    STM_EVAL_LEDInit(LED3);
    STM_EVAL_LEDInit(LED5);
    STM_EVAL_LEDInit(LED6);

    VCP_send_str("USB serial DEMO\ndas-labor.org\n");
    buf[0] = 't';
    buf[1] = 'e';
    buf[2] = 's';
    buf[3] = 't';
    buf[4] = '\r';
    buf[5] = 0;

    VCP_send_str(&buf[0]);
    VCP_put_char('\n');
    buf[0] = 0;
    buf[1] = 0;
    buf[2] = 0;
    buf[3] = 0;
    buf[4] = 0;

//  From stm32f4_discovery.h:
 // typedef enum 
 // {
 //   LED4 = 0,
 //   LED3 = 1,
 //   LED5 = 2,
 //   LED6 = 3
 // } Led_TypeDef;
 // 
    STM_EVAL_LEDToggle(currentLED);
    while(1)
    {
        if (VCP_get_char(buf))
        {
            STM_EVAL_LEDToggle(currentLED);
            currentLED=(currentLED+1)%4;
            STM_EVAL_LEDToggle(currentLED);
            VCP_put_char(buf[0]);
        } 

        if(buf[0]=='\r')  VCP_put_char('\n');
        buf[0]=0;
        // len = VCP_get_string(&buf[0]);
        //         if(len)
        //         VCP_send_str(&buf[0]);
        // if (i == 0x1000000)
        //        {
        //            VCP_put_char('b');
        //            STM_EVAL_LEDOff(LED4);
        //            STM_EVAL_LEDOff(LED3);
        //            STM_EVAL_LEDOff(LED5);
        //            STM_EVAL_LEDOff(LED6); 
        //        }
        //        if (i++ == 0x2000000)
        //        {
        //          i = 0;
        //            VCP_put_char('a');
        //            STM_EVAL_LEDOn(LED4);
        //            STM_EVAL_LEDOn(LED3);
        //            STM_EVAL_LEDOn(LED5);
        //            STM_EVAL_LEDOn(LED6); 
        //        }
    }


}

/**
* @brief  Inserts a delay time.
* @param  nTime: specifies the delay time length, in 10 ms.
* @retval None
*/
void Delay(__IO uint32_t nTime)
{
    TimingDelay = nTime;

    while(TimingDelay != 0);
}

/**
* @brief  Decrements the TimingDelay variable.
* @param  None
* @retval None
*/
void TimingDelay_Decrement(void)
{
    if (TimingDelay != 0x00)
    { 
        TimingDelay--;
    }
}

/**
* @brief  This function handles the test program fail.
* @param  None
* @retval None
*/
void Fail_Handler(void)
{
  /* Erase last sector */ 
    FLASH_EraseSector(FLASH_Sector_11, VoltageRange_3);
  /* Write FAIL code at last word in the flash memory */
    FLASH_ProgramWord(TESTRESULT_ADDRESS, ALLTEST_FAIL);

    while(1)
    {
    /* Toggle Red LED */
        STM_EVAL_LEDToggle(LED5);
        Delay(5);
    }
}


#ifdef  USE_FULL_ASSERT

/**
* @brief  Reports the name of the source file and the source line number
*   where the assert_param error has occurred.
* @param  file: pointer to the source file name
* @param  line: assert_param error line source number
* @retval None
*/
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* User can add his own implementation to report the file name and line number,
  ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
      while (1)
  {
  }
}
#endif

/**
* @}
*/


/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
